#include <iostream>

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
/*

Задание 3. Реализация математического вектора


Что нужно сделать

Реализуйте структуру двумерного математического вектора и основные операции над ним. Обе координаты вектора (x и y)
 должны быть вещественными числами.

Вначале программы пользователь вводит команду, которая соответствует требуемой операции. Далее, в зависимости от
 операции, пользователь вводит её аргументы. Это могут быть как вектора, так и обычные, скалярные значения. В
 результате в стандартный вывод помещается результат. Это тоже может быть или вектор, или скаляр.



Реализуйте следующие операции в виде отдельных функций:

Сложение двух векторов — команда add.
Вычитание двух векторов — команда subtract.
Умножение вектора на скаляр — команда scale.
Нахождение длины вектора — команда length.
Нормализация вектора — команда normalize.


Что оценивается

Корректность работы программы и всех операций над вектором или векторами.



Как отправить задание на проверку

Пришлите ссылку на repl.it или файл .срр с решением через форму для сдачи домашнего задания.



 */