#include <iostream>

int main() {
    std::cout << "Arithmetic mean in the array" << std::endl;


    return 0;
}

/*
Среднее арифметическое в массиве


Что нужно сделать
Реализуйте шаблонную функцию подсчёта среднего арифметического числа в массиве скалярных чисел произвольного типа. Это
 может быть int, double, float и так далее.

Ввод данных массива и вывод результата производится через стандартную консоль.



Советы и рекомендации
Для простоты вы можете реализовать подсчёт в массиве фиксированной длины. Функцию ввода данных массива тоже
 рекомендуется реализовать как шаблонную.



Что оценивается
Корректность работы программы при различных пользовательских данных и различных типах используемых данных массива.
 */