#include <iostream>

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}

/*    Проверка корректности IP-адреса

На этот раз вам нужно проверить, задает ли введенная пользователем строка корректный IP-адрес. IP-адрес должен
 представлять из себя 4 числа, разделенных точками без пробелов, причем каждое число должно быть в диапазоне
 от 0 до 255 включительно. Числа не должны содержать ведущих нулей. Других символов в строке, кроме вышеописанных,
 присутствовать не должно.

Пользователь вводит строку, задающую email-адрес. Программа должна вывести слово Yes, если адрес корректен, а в
 противном случае - слово No.


Примеры корректных IP-адресов:

127.0.0.1

255.255.255.255

1.2.3.4

55.77.213.101



Примеры строк, не являющихся корректными IP-адресами:

255.256.257.258 (числа больше 255)

0.55.33.22. (лишняя точка в конце)

10.00.000.0 (лишние нули)

23.055.255.033 (опять лишние нули)

65.123..9 (две точки подряд)

a.b.c.d (посторонние символы, помимо цифр и точек)

*/
